import Logo from "../logo/Logo";

const Footer = () => (
    <footer className="mt-12 relative bg-white">
            <div className="px-24 relative z-10 mx-auto flex-wrap lg:flex justify-between px-6 py-16 lg:pt-32 pb-6 lg:pb-28">
                <div className="lg:w-1/4 pb-12 lg:pb-0">
                    <Logo />
                    <div className="mt-8 adress text-gray-600">Миасс, ул. Объездная дорога, д. 1/7</div>
                    <div className="my-8 phone-footer">
                        <ul>
                            <li>+7 951 478 2780</li>
                            <li>
                                +7 (904) 305-16-33</li>
                        </ul>
                    </div>
                    <div className="my-12 mail-footer">
                        <a className={'font-bold'} href={'mailto: ventservis74@mail.ru'}>ventservis74@mail.ru</a>
                    </div>
                </div>
                <div className="lg:w-3/5 sm:grid md:grid-cols-2 xl:grid-cols-3  justify-between lg:justify-between">
                    <div className="lg:pr-24 pb-12 lg:pb-0">
                        <h3 className="mb-6 text-lg  font-bold">Строительство</h3>
                        <ul className="menu-list">

                            <li className="mb-3">
                                <a href="">Жилых зданий</a>
                            </li>
                            <li className="mb-3">
                                <a href="">Торговых центров</a>
                            </li>
                            <li>
                                <a href="">Складских помещений</a>
                            </li>
                            <li>
                                <a href="">Автомастерских</a>
                            </li>
                            <li>
                                <a href="">Автомойки</a>
                            </li>
                        </ul>
                    </div>
                    <div className="lg:pr-24 pb-12 lg:pb-0">
                        <h3 className="mb-6 text-lg font-bold">Услуги</h3>
                        <ul className="menu-list">
                            <li className="mb-3">
                                <a href="">Проектирование</a>
                            </li>
                            <li className="mb-3">
                                <a href="">Монтаж инженерных систем</a>
                            </li>
                            <li className="mb-3">
                                <a href="">Кровельные работы</a>
                            </li>
                            <li>
                                <a href="">Отделочные работы</a>
                            </li>
                            <li>
                                <a href="">Реконструкция зданий</a>
                            </li>
                        </ul>
                    </div>
                    <div>
                        <h3 className="mb-6 text-lg font-bold">О компании</h3>
                        <ul className="menu-list">
                            <li className="mb-3">
                                <a href="">Контакты</a>
                            </li>
                            <li className="mb-3">
                                <a href="">Наши объекты</a>
                            </li>
                            <li className="mb-3">
                                <a href="">Документы</a>
                            </li>
                            <li>
                                <a href="">Связаться с нами</a>
                            </li>
                        </ul>
                    </div>
                </div>
                <div className="lg:w-full flex lg:justify-end items-end mt-12 lg:mt-0 social social-footer">
                    <div className="bg-white p-2 rounded-full mr-2.5">

                            <svg xmlns="http://www.w3.org/2000/svg" width="25" height="48.111" viewBox="0 0 25 48.111">
                                <path id="curve"
                                      d="M7,6h9V-15h7l1-9H16v-6a4.742,4.742,0,0,1,1-3c.625-.75,1.313-1,3-1h5v-8a64.629,64.629,0,0,0-7,0,10.971,10.971,0,0,0-8,3c-2,1.969-3,4.438-3,8v7H0v9H7Z"
                                      transform="translate(0 42.111)" fill="rgba(0,0,0,0.12)"/>
                            </svg>



                    </div>
                    <div className="bg-white p-2 rounded-full mr-2.5">
                        <svg xmlns="http://www.w3.org/2000/svg" width="42" height="42" viewBox="0 0 42 42">
                            <path id="Контур_154" data-name="Контур 154"
                                  d="M21-28.781a10.491,10.491,0,0,1,5.391,1.453,10.813,10.813,0,0,1,3.938,3.938A10.491,10.491,0,0,1,31.781-18a10.491,10.491,0,0,1-1.453,5.391,10.813,10.813,0,0,1-3.937,3.938A10.491,10.491,0,0,1,21-7.219a10.491,10.491,0,0,1-5.391-1.453,10.813,10.813,0,0,1-3.937-3.937A10.491,10.491,0,0,1,10.219-18a10.491,10.491,0,0,1,1.453-5.391,10.813,10.813,0,0,1,3.938-3.937A10.491,10.491,0,0,1,21-28.781Zm0,17.813a6.773,6.773,0,0,0,4.969-2.062A6.773,6.773,0,0,0,28.031-18a6.773,6.773,0,0,0-2.062-4.969A6.773,6.773,0,0,0,21-25.031a6.773,6.773,0,0,0-4.969,2.063A6.773,6.773,0,0,0,13.969-18a6.773,6.773,0,0,0,2.063,4.969A6.773,6.773,0,0,0,21-10.969ZM34.781-29.25a2.433,2.433,0,0,0-.75-1.781,2.433,2.433,0,0,0-1.781-.75,2.433,2.433,0,0,0-1.781.75,2.433,2.433,0,0,0-.75,1.781,2.433,2.433,0,0,0,.75,1.781,2.433,2.433,0,0,0,1.781.75,2.283,2.283,0,0,0,1.734-.75A2.921,2.921,0,0,0,34.781-29.25Zm7.125,2.531Q42-24.094,42-18t-.141,8.766a17.68,17.68,0,0,1-.8,4.641A10.927,10.927,0,0,1,38.484-.516a10.927,10.927,0,0,1-4.078,2.578,17.68,17.68,0,0,1-4.641.8Q27.094,3,21,3t-8.766-.141a15.308,15.308,0,0,1-4.641-.891A9.993,9.993,0,0,1,3.516-.516,10.927,10.927,0,0,1,.938-4.594a17.68,17.68,0,0,1-.8-4.641Q0-11.906,0-18t.141-8.766a17.68,17.68,0,0,1,.8-4.641,10.927,10.927,0,0,1,2.578-4.078,10.927,10.927,0,0,1,4.078-2.578,17.68,17.68,0,0,1,4.641-.8Q14.906-39,21-39t8.766.141a17.68,17.68,0,0,1,4.641.8,10.927,10.927,0,0,1,4.078,2.578,10.927,10.927,0,0,1,2.578,4.078A19.073,19.073,0,0,1,41.906-26.719Zm-4.5,21.094a19.739,19.739,0,0,0,.75-5.062q.094-2.062.094-5.812v-3q0-3.844-.094-5.812a18.811,18.811,0,0,0-.75-5.062,6.766,6.766,0,0,0-4.031-4.031,18.812,18.812,0,0,0-5.062-.75Q26.25-35.25,22.5-35.25h-3q-3.75,0-5.812.094a19.739,19.739,0,0,0-5.062.75,6.766,6.766,0,0,0-4.031,4.031,18.812,18.812,0,0,0-.75,5.063Q3.75-23.25,3.75-19.5v3q0,3.75.094,5.813a19.739,19.739,0,0,0,.75,5.063A7.107,7.107,0,0,0,8.625-1.594a19.739,19.739,0,0,0,5.063.75Q15.75-.75,19.5-.75h3q3.844,0,5.813-.094a18.812,18.812,0,0,0,5.063-.75A7.107,7.107,0,0,0,37.406-5.625Z"
                                  transform="translate(0 39)" fill="rgba(0,0,0,0.12)"/>
                        </svg>
                    </div>
                    <div className="bg-white p-2 rounded-full mr-2.5">

                    </div>
                </div>
            </div>


    </footer>
);
export default Footer;
